In [21]:
#pandas.DataFrame( data, index, columns, dtype, copy)

import pandas as pd
x=[1,2,3,4,5,6,7,8,9]

y={'Name':['a','b','c','d'],'Age':[20,30,40,50]}

z=[{'College':['GMR','SASI','KRISHNA','GODAVARI']},{'Distance':[100,200,300,400]}]

a=pd.DataFrame(x,index=['a','b','c','d','e','f','g','h','i'],columns=['Order'])

print(a)

b=pd.DataFrame(y,index=['r1','r2','r3','r4'])
print(b)


with open ('test1.txt' ,'w') as f:
    f.write("Lingababu\n")
    f.write("Guggilapu")

with open('test1.txt','r') as f:
    data=f.readlines()
    print(data)
    
df = pd.DataFrame(data)

print(df,sep=' ')

y={'Name':['a','b','c','d'],'Age':[20,30,40,50]}

df1 = pd.DataFrame(y,index=['r1','r2','r3','r4'])

print(df1)

#how to create the dataframe add the new column and modify the existing column
#how will you convert txt to csv
#how will you convert txt to excell
#how will you convert txt to tsv
#How would you iterate over rows in a DataFrame in Pandas?
#How are iloc() and loc() different?
#How can you sort the DataFrame?
#How can you find the row for which the value of a specific column is max or min?
# Compare the Pandas methods: map(), applymap(), apply()
#How do you split a DataFrame according to a boolean criterion?
#Is it a good idea to iterate over DataFrame rows in Pandas?
#Name the advantage of using applymap() vs apply() method
#What is the difference(s) between merge() and concat() in Pandas?

   Order
a      1
b      2
c      3
d      4
e      5
f      6
g      7
h      8
i      9
   Name  Age
r1    a   20
r2    b   30
r3    c   40
r4    d   50
['Lingababu\n', 'Guggilapu']
             0
0  Lingababu\n
1    Guggilapu
   Name  Age
r1    a   20
r2    b   30
r3    c   40
r4    d   50

In [18]:
df1.head(3)

   Name  Age
r1    a   20
r2    b   30
r3    c   40

In [20]:
df1.tail(3)

   Name  Age
r2    b   30
r3    c   40
r4    d   50

In [22]:
df1.sample()

   Name  Age
r3    c   40

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 96.0+ bytes

In [25]:
df1.dtypes

Name    object
Age      int64
dtype: object

In [26]:
df1.shape

(4, 2)

In [28]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [29]:
df.describe()

                  0
count             2
unique            2
top     Lingababu\n
freq              1

In [34]:
df1.query('Age > 20')

   Name  Age
r2    b   30
r3    c   40
r4    d   50

In [35]:
df1.loc['r3']

Name     c
Age     40
Name: r3, dtype: object

In [36]:
df1.iloc[0]

Name     a
Age     20
Name: r1, dtype: object

In [37]:
df1['Name'].unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [40]:
df1['Name'].unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [41]:
df.isnull()

       0
0  False
1  False

In [45]:
df1.fillna('MissingInfo',inplace=True)

In [46]:
df1

   Name  Age
r1    a   20
r2    b   30
r3    c   40
r4    d   50

In [48]:
df1.sort_values("Age")

   Name  Age
r1    a   20
r2    b   30
r3    c   40
r4    d   50

In [49]:
df1.value_counts('Age')

Age
20    1
30    1
40    1
50    1
dtype: int64

In [53]:
df1.nlargest(3,'Age')

   Name  Age
r4    d   50
r3    c   40
r2    b   30

In [55]:
df1.nsmallest(3,'Age')

   Name  Age
r1    a   20
r2    b   30
r3    c   40

In [56]:
df2= df1.iloc[0:2].copy()
df2

   Name  Age
r1    a   20
r2    b   30

In [57]:
df1

   Name  Age
r1    a   20
r2    b   30
r3    c   40
r4    d   50

In [62]:
df1.rename(columns={'Name':'Integers'},inplace=True)
df1

   Integers  Age
r1        a   20
r2        b   30
r3        c   40
r4        d   50

In [65]:
df1.drop('Age',axis=1)

   Integers
r1        a
r2        b
r3        c
r4        d

In [66]:
df1.corr()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_2344\473017434.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.corr()

     Age
Age  1.0

In [56]:
with open('hyderabad.txt','w') as f:

    f.write("1,lingababu,30,GMR Degree college,Madhapur,\n,2,Nagalakshmi,28,AG&SG Degree college,pammauru")
    
with open('hyderabad.txt','r') as f1:
    
    data=f1.read()
    print(data)

1,lingababu,30,GMR Degree college,Madhapur,
,2,Nagalakshmi,28,AG&SG Degree college,pammauru

In [59]:
import pandas as pd

df = pd.read_csv("hyderabad.txt")

data=df.to_csv("hyderabad.txt")


df1=pd.DataFrame(data,columns=['S.N0','Student Name','Age','College','Area'])
df1

Empty DataFrame
Columns: [S.N0, Student Name, Age, College, Area]
Index: []